{
    "text": "Premium Ice Creams with 100% Real Ingredients\nmenu\nHome\nNIC Story\nProducts\nProducts\nNIC Talks\nBlogs\nVideos\nPress\nOur Parlours\nContact\nFlavours as deep as\nfriendship\nHonest, artisanal and delicious\nwith a dash of hand-crafted\nl\nv\ne\nNIC Ice Creams are all heart, pure milk, and real ingredients\nin every scoop. Too good to share unless it’s with your BFFs\nOur Story\nA NIC in every\nParlours\n+\nCities\nMore is Merrier\n6 categories and 50 flavours packed with chunks of real fruits and choicest ingredients from across the world that offer deepest flavours in every scoop\nView All\nFruit N Nut\nJuicy fruits, crunchy nuts-proof that opposites attract in the most delicious ways.\nInternational Inspiration\nTimeless flavours that cross borders and bring the world to your scoop, one classic bite at a time.\nIndian Inspirations\nFestive memories meet creamy indulgence with gulab jamun, sheer khurma, and pure soul in every bite.\nSpeciality\nWhisk your taste buds away to far-off lands with global desserts reimagined.\nSuper Premium\nIce cream that dresses for the occasion. Sophistication meets indulgence in every velvety swirl.\nNo Added Sugar\nSo delicious and light, they feel like a compliment. Guilt-free? Yes. Irresistible? Always.\nAcross\n50+\nflavours\nThe season's best scoop\nMore chocolate More chuckles\nRelish madagascar chocolate in every scoop.\nKnow More\nMore berry\nMore merry\nEnjoy cranberries, blueberries and strawberries\nKnow More\nMore coconut More chatter\nSavour creamy tender coconut pieces in every scoop\nKnow More\nReal ingredients\nIn every scoop\nWe've scoured the globe to handpick premium ingredients for your delight– think cocoa all the way from Madagascar and strawberries straight from Mahabaleshwar. We go the distance to bring you the best.\nThe method behind our magic\nYour favourite ice cream is crafted from nature’s finest selection of fruits, the creamiest milk and zero preservatives, all churned together with a touch of magic and a lot of love. It’s crafted for those moments where every laugh echoes louder, every smile feels warmer, and every spoonful tastes better with your closest friends.\nReal flavours,\nreal stories\n\"\nCreamy, dreamy, and utterly delicious; a sweet escape awaits.\n\"\n\"\nI love going to NIC parlour with my bestie\n\"\n\"\nSmooth, rich, and utterly delightful; a scoop of happiness.\n\"\nLatest Scoop\nBlogs\nVideos\nPress\nView More\n10th Jan 2025\nA Guilt-Free Scoop: Indulge in the Creamiest Ice Cream with No Added Sugar!\nRead More\n11th Jan 2025\nThe Fruity Scoop: Mango, Coconut & More - A No Added Sugar Delight!\nRead More\n13th Jan 2025\nA Chocolate Lover’s Dream: The Best Ice Cream Flavors to Indulge In!\nRead More\nNIC Ice creams - Mixed berries\nNIC Ice Creams - Upvas Friendly\nCut down on sugar, not taste | NIC's No Added Sugar Ice Cream\nChristmas Miracle | NIC Ice Creams\nNIC Thandai Ice Cream: Eat It, Don't Sip It | The Coolest Scoop this Holi\nParty kab tak? Tub rahega tab tak | NIC Ice Creams\nBrands take festive mood to new high with Holi campaigns\nNIC Ice Cream launches #NayeZamaneKaNayaJashn ahead of the Holi celebrations\nNIC Honestly Crafted Ice Creams launches two new flavors – Gajar Halwa  and Til Gud with Ravdi\nNIC Honestly Crafted Ice Creams Rings in New Year with 2 new exciting flavors\nNIC Ice cream launches waffles cones\nDrop by...\nSelect State\nSelect City\nSelect Pincode\nNIC Ice Creams Hyderabad\nNIC Ice Creams, Kothapet, Dilsukhnagar, Main Road, beside BSNL Main Gate, Hyderabad, Telangana\nNIC Ice Creams Navi Mumbai\nShop No. 9, Shiv Darshan, Ground Floor, Plot No. 1, Sector 15, CBD Belapur, Navi Mumbai\nNIC Ice Creams Mumbai\nShop No. 2, Ram Janaki Building, next to Ganesh Mandir, Phadke Road, Dombivli East\nNIC Ice Creams Mumbai\nNIC Ice Cream, Link Square Mall, 33rd Road, Linking Road, opposite KFC, Bandra West, Mumbai, Maharashtra\nNIC Ice Creams Thane\nShop No. 02, Ground Floor, Building Nos. 7-8-9, opposite RBK School Phase 1, Beverly Park Kanakia, Mira Road (East), Thane\nNIC Ice Creams Behrampur\nGiri Road, near Geetha Bhawan, beside Budapest Bakelen, Berhampur, Odisha\nNIC Ice Creams Patiala\nKravings Food Court, Central Park, Thapar Institute of Engineering & Technology, Bhadson Road, Adarsh Nagar, Prem Nagar, Patiala, Punjab\nNIC Ice Creams Ludhiana\nHotel Imperial Executive, Pakhowal Road, Gurudev Nagar, Ludhiana, Punjab\nNIC Ice Creams Chandigarh\nSCO No. 469, NIC Ice Cream, Ground Floor, Sector 35-C, Chandigarh, near Hotel Himani's\nNIC Ice Creams Ajmer\nFood Court, Mittal Mall, Prithviraj Marg, Ajmer, Rajasthan\nNIC Ice Creams Pune\nNIC Ice Cream, Shop Nos. 12 & 13, Riddhi Enclave, Viman Nagar, Pune, Maharashtra\nNIC Ice Creams Hyderabad\nPlot No. 4-1421, Ground Floor, JPS Plaza, Raja Rajeswari Nagar, Kondapur, Hyderabad, Telangana\nNIC Ice Creams Nizamabad\nNH 63, Maruti Nagar, Nizamabad, Telangana\nNIC Ice Creams Lucknow\nCCSI Amausi Airport, International Departure, Gate No. 1, Lucknow, Uttar Pradesh\nNIC Ice Creams Ayodhya\nShop No. 2, Ground Floor, Ayodhya–Faizabad Road, opposite Jal Sansthan, Avas Vikas Colony, Amanigunj, Ayodhya, Uttar Pradesh\nNIC Ice Creams Kolkata\nB-31, Ground Floor, Block B, AA 3, P.S. New Town, Kolkata, West Bengal\nNIC Ice Creams Siliguri\nShop No. 7, Dwarika Garden, Mangal Pandey Road, behind Fire Brigade, Khalpara, Siliguri, West Bengal\nNIC Ice Creams Ayodhya\nKiosk No. 1, Second Floor, Mall of Awadh, Rampath Main Road, Nahar Bagh, near Tarang Cinema, Faizabad Tehsil, Ayodhya, Uttar Pradesh\nNIC Ice Creams Bangalore\nPrestige Tech Park, Unit No. Prestige Tech Park-IV, Gravity Building, Kadubeesanahalli, Outer Ring Road, Bellandur, Karnataka\nNIC Ice Creams Karnal\nKarnal Haveli, National Highway 44 (NH-1), near Vivan Hotel\nNIC Ice Creams Haridwar\nNIC Ice Cream, next to Crystal World, Delhi Road, Haridwar-Roorkee NH-58, Badheri Rajputan, Haridwar, Uttarakhand\nNIC Ice Creams Kakinada\nNIC Ice Cream, 3rd Floor, SRMT Mall & Multiplex, Sarpavaram Junction, Kakinada\nNIC Ice Creams Delhi\nJawahar Nagar - Malka Ganj Road, near Gouri Nursing Home, opposite New Delhi, Block UA, Jawahar Nagar, Kamla Nagar, Delhi\nNIC Ice Creams New Delhi\nA-56, Veer Savarkar Marg, Block A, Lajpat Nagar II, Lajpat Nagar, New Delhi, Delhi\nNIC Ice Creams New Delhi\nNIC Ice Cream, Property No. P-35,36, Pandav Nagar, near Alkon Public School, Mayur Vihar Phase 1, Delhi\nNIC Ice Creams New Delhi\nJ-2/6B, B.K. Dutta Market, Rajouri Garden, Delhi\nNIC Ice Creams Panjim\nGround Floor, Shop No. 17, Alfran Plaza, M.G. Road, Panaji, Goa\nNIC Ice Creams MOPA\nFCO 04, Arrival Forecourt, Mopa, Pernem, North Goa, Goa\nNIC Ice Creams Gurgaon\nBottle Lab Technologies Pvt. Ltd., Food Court, Ground Floor, Tower C, Building No. 2, DLF Cyber Green Building, DLF Phase 3, Sector 24, Gurugram, Haryana\nNIC Ice Creams Delhi\nJawahar Nagar - Malka Ganj Rd, nr. gouri nursing home, opp. New Delhi, Block UA, Jawahar Nagar, Kamla Nagar, Delhi\nNIC Ice Creams Gurgaon\nShop No. 14, Ground Floor, Elan Epic, Southern Peripheral Road, opposite Tulip Violet, Sector 70, Gurugram, Haryana\nNIC Ice Creams UNA\nUnit No. 5, Ground Floor, Virsa Food Point, Green Avenue Road, Jalgran, Tabba, Una, Himachal Pradesh\nNIC Ice Creams Bangalore\nFreshpik, 4th Floor, One MG Lido Mall, 1/2 Old Madras Road, Halsuru, Someshwarpura, Sivanchetti Gardens, Bangalore\nNIC Ice Creams Bangalore\nShop No. 775, Ground Floor, 16th Main, MICO Employee Griniram Sanstha, BTM Layout 2nd Stage, Bangalore\nNIC Ice Creams Chindwara\nPatni Complex, Shop No. 19, near Titan Showroom, Chhindwara, Madhya Pradesh\nNIC Ice Creams Mumbai\nShop No. 2, W, CV Chawl, opposite Bussa Industry, Hanuman Gali, Lower Parel West, Lower Parel, Mumbai\nNIC Ice Creams Alibagh\nContainer No. 17, Mandwa RoRo Jetty, Mandwa, Alibaug, Maharashtra\nNIC Ice Creams Pune\nShop No. 1, Shankar Kalate Nagar Road, Pristine Square, Wakad, Pune, Maharashtra\n+917028080321\ncustomercare@nicicecreams.com\nNIC Story\nNIC Talks\nBlogs\nVideos\nPress\nProducts\nOur Parlours\nContact\nPrivacy Policy\nCopyright ©\n2025\nAll Rights Reserved by NIC Ice Cream."
  }