{
    "text": "moti mahal lucknow\nआपका स्वागत है\nAll Welcome\nCall Us\n+91 9115783196\nHome\nAbout Us\nAbout Us\nOur Team\nBrands\nMoti Mahal\nMoti Mahal Barbecues\nMM Café\nChina wall\nFranchise\nLegacy\nMoti Mahal Owner\nContact Us\nHome\nAbout Us\nAbout Us\nOur Team\nBrands\nMoti Mahal\nMoti Mahal Barbecues\nMM Café\nChina Wall\nFranchise\nGallery\nMoti Mahal's Owner\nContact Us\nCall Us\n+91 9115783196\nmoti mahal lucknow\nMoti Mahal Delux – LucknowWelcome to Moti Mahal Delux, Lucknow’s ultimate destination for authentic Indian cuisine. Located at 94, Mahatma Gandhi Marg in the heart of Hazratganj, our restaurant offers a unique dining experience that blends rich Indian flavors with modern hospitality. Whether you’re here for a family gathering, casual dining, or a business meal, Moti Mahal Delux Lucknow guarantees an unforgettable culinary experience.Authentic Indian Cuisine in LucknowAt Moti Mahal Delux Lucknow, we take great pride in offering a wide variety of Indian dishes, made with the freshest ingredients. Our chefs specialize in creating flavorful curries, perfectly grilled tandoori items, and a range of vegetarian and non-vegetarian delicacies. Lucknow’s food enthusiasts have come to rely on us for the finest Indian dining.Why Choose Moti Mahal Delux in Lucknow?\t•\tIconic Legacy: With over 100 outlets globally, Moti Mahal Delux is known for its authentic Indian cuisine. Our Lucknow outlet upholds this legacy by delivering high-quality dishes with exceptional service.\t•\tSignature Dishes: Indulge in our famous butter chicken, tandoori chicken, and dal makhani—each prepared with the highest attention to detail.\t•\tPrime Location: Conveniently located on Mahatma Gandhi Marg in Hazratganj, our Lucknow restaurant is easily accessible with ample parking available.\t•\tInviting Ambiance: Whether it’s a casual meal or a special celebration, the warm atmosphere at Moti Mahal Delux Lucknow ensures a delightful experience.Menu Highlights at Moti Mahal LucknowOur extensive menu offers a variety of Indian favorites to satisfy every palate. Some of the most-loved dishes at Moti Mahal Delux Lucknow include:\t•\tButter Chicken: A Moti Mahal classic, our butter chicken is cooked in a rich, creamy tomato sauce with tender chicken pieces.\t•\tTandoori Chicken: Marinated in a blend of spices and yogurt, then grilled to perfection in our traditional tandoor for a smoky flavor.\t•\tPaneer Tikka: Marinated cubes of paneer, grilled in the tandoor, bursting with traditional Indian spices.\t•\tDal Makhani: A slow-cooked, creamy lentil dish, perfect when paired with naan or rice.Location & Contact Information\t•\tAddress: Moti Mahal Delux, 94, Mahatma Gandhi Marg, Raj Bhavan Colony, Hazratganj, Lucknow, Uttar Pradesh 226001Operating Hours\t•\tMonday to Sunday: 12:00 PM – 11:00 PMLocal Reviews from LucknowHere’s what our guests in Lucknow have to say:\t•\t“The butter chicken is amazing! One of the best Indian restaurants in Hazratganj.” – Rohit M.\t•\t“Great ambiance and delicious food. The tandoori dishes are exceptional!” – Shruti P.\t•\t“Moti Mahal Delux Lucknow is my favorite spot for Indian cuisine. Highly recommended!” – Rajiv K.Frequently Asked Questions (FAQs)Q: Is parking available at the restaurant?A: Yes, we offer ample parking for our guests at our Lucknow location.Q: Do you offer vegetarian and vegan options?A: Yes, we have a variety of vegetarian dishes, and some can be customized to be vegan.Q: Can I book the restaurant for private events?A: Yes, we accept bookings for private events such as birthdays, corporate events, and family gatherings. Contact us for more information.\nFranchise with Us\nJoin the exclusive Moti Mahal family and launch your own successful restaurant. Benefit from our comprehensive support to establish a thriving business in the culinary world.\nInterested?\nClick below, and let's start your journey to success together\n.\nYour Name\nPhone Number\nEmail Id\nYour Message\nThank you! Your submission has been received!\nOops! Something went wrong while submitting the form.\n+91 9115-783196\nprojects@motimahalgroup.in\n17/1 Kalkaji, Near Deshbandhu College, New Delhi, India - 110019\nContact Us\nBlog\nCareers\nOur Locations\nPrivacy\n© Gujral and son moti mahal delux LLP.\n© Moti Mahal 2024.\n© Copyright. All right reserved.\nFranchise with Us\nYour Name\nPhone Number\nEmail Id\nYour Message\nThank you! Your submission has been received!\nOops! Something went wrong while submitting the form."
  }